<template>
  <q-page class="flex-center">
    <q-splitter v-model="splitterModel" horizontal>
      <template v-slot:before>
        <div class="row">
          <q-tabs
            v-model="tab"
            class="tabColor"
            inline-label
            outside-arrows
            mobile-arrows
          >
            <q-tab :name="'privacyPolicy'" label="隐私政策" />
          </q-tabs>
        </div>
      </template>
      <template v-slot:after>
        <q-tab-panels
          v-model="tab"
          animated
          vertical
          transition-prev="jump-up"
          transition-next="jump-down"
        >
          <q-tab-panel class="inside-cont-term-privacy" name="privacyPolicy">
            <div class="text-h4 q-mb-md">货币汇率换算器隐私政策</div>
            <span class="text-h6">版本更新日期：2022 年 10月 4日 </span>
            <span class="text-h6"> 版本生效日期：2022年 10月 4日 </span>
            <p>公司：漳州市巨雷网络有限公司</p>
            <p>地址：福建省漳州市古雷港经济开发区杜浔镇近城村城内自然村278号</p>
            <div class="text-h4 q-mb-md">目录:</div>
            <p><b> 我公司如何收集和使用您的个人信息 </b></p>
            <p><b> 我公司如何使用Cookie和同类技术 </b></p>
            <p><b> 我公司如何共享、转让、公开披露您的个人信息 </b></p>
            <p><b> 我公司如何保护您的个人信息 </b></p>
            <p><b> 您的权利 </b></p>
            <p><b> 我公司如何处理儿童的个人信息 </b></p>
            <p><b> 您的个人信息如何在全球范围转移 </b></p>
            <p><b> 本隐私政策如何更新 </b></p>
            <p><b> 如何联系我公司 </b></p>
            <p><b> 争议解决 </b></p>
            <p>
              <b>货币汇率换算器</b>
              是为您提供的一款在线管理,报修器材和内容管理的app.。公司十分尊重您的个人信息和数据，
              并会尽全力保护您的个人信息和数据的安全可靠。本政策仅适用于
              应用收集和 存储的用户信息和数据。货币汇率换算器软件(以下简称
              本应用) 本应用非常重视用户隐私政策并严格 遵守相关的法律规定。请
              您仔细阅读本隐私政策后再继续使用。如果您继续使用
              我们的服务，表示您已经 充分阅读和理解我们协议的全部内容。 本 app
              尊重并保护有使用服务用户的 个人隐私权。为了给您提供
              更准确、更优质的服务，本应用会按照本隐私权政策的规定使用和披露您的个人
              信息。除本隐私权政策另
              有规定外，在未征得您事先许可的情况下，本应用不会将这些信息对外披露或向
              第三方提供。本应用会不 时更新本隐私权政策。
              您在同意本应用服务使用协议之时，即视为您已经同意
              本隐私权政策全部内容。
            </p>
            <p>
              <b>
                我们的产品基于DCloud uni-app(5+
                App/Wap2App)开发，应用运行期间需要收集您的设备唯一识别码（IMEI/android
                ID/DEVICE_ID/IDFA、SIM 卡 IMSI
                信息）以提供统计分析服务，并通过应用启动数据及异常错误日志分析改进性能和用户体验，为用户提供更好的服务。
              </b>
              <a href="https://ask.dcloud.net.cn/protocol.html">
                详情内容请访问《DCloud用户服务条款》
              </a>
            </p>
            <p class="text-h4 q-mb-md">我公司如何收集和使用您的个人信息</p>
            <p class="text-h5 q-mb-md">1,个人信息和个人敏感信息定义</p>
            <p>
              个人信息，指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。我公司实际具体收集的个人信息种类以下文描述为准。
            </p>
            <p>
              个人敏感信息，指一旦泄露、非法提供或滥用可能危害人身和财产安全，极易导致个人名誉、身心健康受到损害或歧视性待遇等的个人信息。我公司实际具体收集的个人敏感信息种类以下文描述为准。
            </p>
            <p class="text-h5 q-mb-md">2,我公司如何收集和使用您的个人信息</p>
            <p>
              (a) 在您使用本应用网络服务，或访问本应用平台网页时，本应用自动接收并记录的您的浏览器和计算机上的信息，包括但不限于您的IP地址、浏览器的类型、使用的语言、访问日期和时间、软硬件特征信息及您需求的网页记录等数据；
            </p>
            <p>(b) 本应用通过合法途径从商业伙伴处取得的用户个人数据。</p>
            <p>
              (c)本应用严禁用户发布不良信息，如裸露、色情和亵渎内容，发布的内容我们会进行审核，一经发现不良信息，会禁用该用户的所有权限，予以封号处理。
            </p>
            <p class="text-h5 q-mb-md">3,权限收集列表以及用途说明</p>
            <p>
              读取手机识别码:
              设备信息通常在反作弊和判断账号是否处于安全环境有重要作用
            </p>
            <p>拨打电话: 方便用户联系客服拨打电话，和申报维修工作等</p>
            <p>获取GPS定位：方便填写位置信息进行维护工作</p>
            <p>相机权限:方便上传维修照片已经换头像等功能</p>
            <p>相册权限:方便上传维修照片已经换头像等功能</p>
            <p>三方SDK列表:</p>
            <table border="1">
              <tr>
                <td>SDK名称</td>
                <td>SDK包名</td>
                <td>SDK用途</td>
                <td>可能获取的个人信息类型</td>
                <td>调用的设备权限</td>
                <td>官网链接</td>
              </tr>
              <tr>
                <td>阿里weexSDK</td>
                <td>com.taobao</td>
                <td>uni-app基础模块默认集成，用于渲染uniapp的nvue页面引擎</td>
                <td>存储的个人文件</td>
                <td>读取外置存储器、写入外置存储器</td>
                <td>
                  <a href="http://doc.weex.io/zh">http://doc.weex.io/zh</a>
                </td>
              </tr>
              <tr>
                <td>fresco图片库</td>
                <td>com.facebook.fresco</td>
                <td>uni-app基础模块默认集成，用于nvue页面加载图片使用</td>
                <td>存储的个人文件</td>
                <td>读取外置存储器、写入外置存储器</td>
                <td>
                  <a href="https://www.fresco-cn.org/">
                    https://www.fresco-cn.org/
                  </a>
                </td>
              </tr>
            </table>
            <div class="text-h4 q-mb-md">二, 我们如何使用Cookie技术</div>
            <p>
              为确保网站或APP正常运转，我们会在您的计算机或移动设备上储存名为Cookie的小数据文件。
            </p>
            <p>
              Cookie通常包含标识符、站点名称以及一些号码和字符。借助于Cookie，网站或APP能够储存您的偏好数据。我们不会将Cookie用于本政策所述目的之外的任何用途。您可根据自己的偏好管理或删除Cookie。您可以清除计算机上保存的所有Cookie，大部分网络浏览器都设有阻止Cookie的功能。但如果您这么做，则需要在每一次访问我们的网站或APP时更改用户设置。
            </p>
            <p class="text-h4 q-mb-md">
              三, 我公司如何共享、转让、公开披露您的个人信息
            </p>
            <p class="text-h5 q-mb-md">共享</p>
            <p>
              我公司不会与我公司以外的任何公司、组织和个人分享您的个人信息，但以下情况除外：
            </p>
            <p>事先已获得您的明确授权或同意；</p>
            <p>
              根据适用的法律法规、法律程序、政府的强制命令或司法裁定而需共享您的个人信息；
            </p>
            <p>
              在法律要求或允许的范围内，为了保护简书及其用户或社会公众的利益、财产或安全免遭损害而有必要提供您的个人信息给第三方
            </p>
            <p>
              您的个人信息可能会在我公司关联公司之间共享。我公司只会共享必要的个人信息，且这种共享亦受本隐私政策声明目的的约束。关联公司如要改变个人信息的处理目的，将再次征求您的授权同意；
            </p>
            <p class="text-h5 q-mb-md">转让</p>
            <p>
              我公司不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：
            </p>
            <p>获得您的明确同意后，我公司会向其他方转让您的个人信息；</p>
            <p>
              在涉及合并、收购或破产清算时，如涉及到个人信息转让，我公司会在要求新的持有您个人信息的公司、组织继续受此隐私政策的约束，否则我公司将要求该公司、组织重新向您征求授权同意
            </p>
            <div class="text-h5 q-mb-md">公开披露</div>
            <p>我公司仅会在以下情况下，公开披露您的个人信息：</p>
            <p>获得您明确同意后；</p>
            <p>
              基于法律的披露：在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我公司可能会公开披露您的个人信息
            </p>
            <div class="text-h4 q-mb-md">四、我公司如何保护您的个人信息</div>
            <p>
              1、我公司已使用符合业界标准的安全防护措施保护您提供的个人信息，防止数据遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我公司会采取一切合理可行的措施，保护您的个人信息。例如我公司使用加密技术确保数据的保密性；我公司会使用受信赖的保护机制防止数据遭到恶意攻击；我公司会部署访问控制机制，确保只有授权人员才可访问个人信息；以及我公司会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。
            </p>
            <p>
              2、我公司在中华人民共和国境内收集和产生的个人信息将存储在中华人民共和国境内，不会进行任何数据出境。您的个人信息存储期限为10年；10年期满后如您继续在使用服务的，该等服务必需的个人信息的存储期限再续10年，如届时您已经不再使用服务的，我公司将及时删除您的个人信息。
            </p>
            <p>
              3、尽管已经采取了上述合理有效措施，并已经遵守了相关法律规定要求的标准，但请您理解，由于技术的限制以及可能存在的各种恶意手段，在互联网行业，即便竭尽所能加强安全措施，也不可能始终保证信息百分之百的安全，我公司将尽力确保您提供给我们的个人信息的安全性。
            </p>
            <p>
              您知悉并理解，您接入我公司的服务所用的系统和通讯网络，有可能因我们可控范围外的因素而出现问题。因此，我们强烈建议您采取积极措施保护个人信息的安全，包括但不限于使用复杂密码、定期修改密码、不将自己的帐号密码及相关个人信息透露给他人。
            </p>
            <p class="text-h4 q-mb-md">五、您的权利</p>
            <p>
              按照中国相关的法律、法规、标准，以及其他国家、地区的通行做法，我公司保障您对自己的个人信息行使以下权利：
            </p>
            <p>访问您的个人信息</p>
            <p>访问头像、昵称、性别等基本信息：</p>
            <p>更正您的个人信息</p>
            <p>
              当您发现我公司处理的关于您的个人信息有错误时，您有权要求我公司做出更正。
            </p>
            <p>删除您的个人信息</p>
            <p>在以下情形中，您可以向我公司提出删除个人信息的请求：</p>
            <p>（1）如果我公司处理个人信息的行为违反法律法规；</p>
            <p>（2）如果我公司收集、使用您的个人信息，却未征得您的同意；</p>
            <p>（3）如果我公司处理个人信息的行为违反了与您的约定；</p>
            <p>（4）如果您不再使用我公司的产品或服务，或您注销了帐号；</p>
            <p>（5）如果我公司不再为您提供产品或服务。</p>
            <p>
              若我公司决定响应您的删除请求，我公司还将同时通知从我公司获得您的个人信息的实体，要求其及时删除，除非法律法规另有规定，或这些实体获得您的独立授权。
            </p>
            <p>
              当您从我公司的服务中删除信息后，我公司可能不会立即备份系统中删除相应的信息，但会在备份更新时删除这些信息。
            </p>
            <p>撤回同意</p>
            <p>
              您可以通过关闭设备功能改变您授权我公司继续收集个人信息的范围或撤回您的授权。您还可以通过注销帐户的方式，撤回我公司继续收集您个人信息的全部授权。
            </p>
            <p>5、退出帐户</p>
            <p>您随时可退出此前注册的帐户，您可以通过以下方式自行操作：</p>
            <p>系统设置-退出账号</p>
            <p>
              在退出帐户之后，我公司将停止为您提供产品或服务，并依据您的要求，删除您的个人信息，法律法规另有规定的除外。
            </p>
            <p>在以下情形中，按照法律法规要求，我公司将无法响应您的请求：</p>
            <p>与国家安全、国防安全直接相关的</p>
            <p>与公共安全、公共卫生、重大公共利益直接相关的；</p>
            <p>与犯罪侦查、起诉、审判和判决执行等直接相关的；</p>
            <p>有充分证据表明您存在主观恶意或滥用权利的</p>
            <p>响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的</p>
            <p>涉及商业秘密的。</p>
            <p>6、注销账号</p>
            <p>
              如果您需要注销您的账户，按照如下格式:
              登录账号+注销理由,发送至qyezcb221@aliyun.com 此邮箱。
              工作人员将在3-5个工作日审核。
            </p>
            <p>
              我们在此善意的提醒您，这将会导致我们终止对您提供本服务，也会给您的售后维权带来诸多不便。注销成功后，我们将依据您的要求，删除您的个人信息，法律法规另有规定的除外。
            </p>
            <p>
              请您注意：账户一旦被注销将不可恢复，请您在操作之前自行备份账户相关信息和数据。注销账户您将无法使用，也将无法找回您账户中及与账户相关的任何内容或信息
            </p>
            <p class="text-h4 q-mb-md">六、我公司如何处理儿童的个人信息</p>
            <p>
              我公司的产品、网站和服务主要面向成人。如果没有父母或监护人的同意，儿童不得创建自己的用户帐户。
            </p>
            <p>
              对于经父母同意而收集儿童个人信息的情况，我公司只会在受到法律允许、父母或监护人明确同意或者保护儿童所必要的情况下使用或公开披露此信息。
            </p>
            <p>
              尽管当地法律和习俗对儿童的定义不同，但我公司将不满18周岁的任何人均视为儿童。
            </p>
            <p>
              如果我公司发现自己在未事先获得可证实的父母同意的情况下收集了儿童的个人信息，则会设法尽快删除相关数据。
            </p>
            <p class="text-h4 q-mb-md">七、您的个人信息如何在全球范围转移</p>
            <p>
              目前我公司不会跨境传输或存储您的个人信息。将来如需跨境传输或存储的，我公司会向您告知信息出境的目的、接收方、安全保障措施和安全风险，并征得您的同意。
            </p>
            <p class="text-h4 q-mb-md">八、本隐私政策如何更新</p>
            <p>
              我公司的隐私政策可能变更。未经您明确同意，我公司不会削减您按照本隐私政策所应享有的权利。我公司会在本页面上发布对本隐私政策所做的任何变更。对于重大变更，我公司还会提供更为显著的通知。本隐私政策所指的重大变更包括但不限于：
            </p>
            <p>
              1、我公司的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；
            </p>
            <p>
              2、我公司在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；
            </p>
            <p>3、个人信息共享、转让或公开披露的主要对象发生变化；</p>
            <p>
              5、我公司负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；
            </p>
            <p>6、个人信息安全影响评估报告表明存在高风险时。</p>
            <p>我公司还会将本隐私政策的旧版本存档，供您查阅。</p>
            <p class="text-h4 q-mb-md">九、如何联系我公司</p>
            <p>
              如您对本隐私政策有任何疑问、意见或建议，您可以通过如下方式与我公司联系。一般情况下，我公司将在15个工作日内回复您。
            </p>
            <p>
              电子邮件：
              <a href="mailto:qyezcb221@aliyun.com"> qyezcb221@aliyun.com </a>
            </p>
            <p class="text-h4 q-mb-md">十、争议解决</p>
            <p>
              感谢您花时间了解我们的隐私政策！我们将尽全力保护您的个人信息和合法权益，再次感谢您的信任
            </p>
            <p></p>
          </q-tab-panel>
        </q-tab-panels>
      </template>
    </q-splitter>
  </q-page>
</template>

<script>
import { defineComponent, ref } from "vue";

export default defineComponent({
  name: "IndexPage",
  setup() {
    document.title = "Term&Condition-Currency";

    const tab = ref("privacyPolicy");
    const splitterModel = ref(20);

    return { tab, splitterModel };
  },
});
</script>

<style>
.inside-cont-term-privacy {
  padding: 10vh 10vw;
}

.tabColor {
  color: #e8aa10;
}

.block {
  font-size: 21px;
}

@media screen and (max-width: 910px) {
  .block {
    font-size: 17px;
  }
}
</style>
